{
  "jobs": [
    {
      "id": "1",
      "type": "Full-Time",
      "title": "Senior React Developer",
      "description": "We are seeking a talented Front-End Developer to join our team in Lahore, Pakistan. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as React or Angular.",
      "salary": "PKR 250K - 300K",
      "location": "Lahore",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@teksolutions.pk",
        "contactPhone": "042-111-222-333"
      }
    },
    {
      "id": "2",
      "type": "Full-Time",
      "title": "Front-End Engineer (React & Redux)",
      "description": "Join our team as a Front-End Developer in Karachi, Pakistan. We are looking for a motivated individual for crafting beautiful and responsive web applications. Experience with UI/UX design principles and a strong attention to detail are highly desirable.",
      "salary": "PKR 200K - 250K",
      "location": "Karachi",
      "company": {
        "name": "Veneer Solutions",
        "description": "Veneer Solutions is a creative agency specializing in digital design and development. Our team is dedicated to pushing the boundaries of creativity and innovation to deliver exceptional results for our clients.",
        "contactEmail": "contact@veneersolutions.pk",
        "contactPhone": "021-34567890"
      }
    },
    {
      "id": "3",
      "type": "Full-Time",
      "title": "React.js Developer",
      "description": "Are you passionate about front-end development? Join our team in Islamabad, Pakistan, and work on exciting projects that make a difference. We offer competitive compensation and a collaborative work environment where your ideas are valued.",
      "salary": "PKR 150K - 200K",
      "location": "Islamabad",
      "company": {
        "name": "Dolor Cloud",
        "description": "Dolor Cloud is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "contact@dolorcloud.pk",
        "contactPhone": "051-9876543"
      }
    },
    {
      "id": "4",
      "type": "Part-Time",
      "title": "React Front-End Developer",
      "description": "Join our team as a Part-Time Front-End Developer in Peshawar, Pakistan. We are looking for a self-motivated individual with a passion for creating engaging user experiences. This position offers flexible hours and the opportunity to work remotely.",
      "salary": "PKR 250K - 300K",
      "location": "Peshawar",
      "company": {
        "name": "Alpha Elite",
        "description": "Alpha Elite is a dynamic startup specializing in digital marketing and web development. We are committed to fostering a diverse and inclusive workplace where creativity and innovation thrive.",
        "contactEmail": "contact@alphaelite.pk",
        "contactPhone": "091-8765432"
      }
    },
    {
      "id": "5",
      "type": "Full-Time",
      "title": "Full Stack React Developer",
      "description": "Exciting opportunity for a Full-Time Full Stack Developer in Lahore, Pakistan. We are seeking a talented individual with a passion for building elegant and scalable web applications. Join our team and make an impact!",
      "salary": "PKR 500K - 600K",
      "location": "Lahore",
      "company": {
        "name": "Browning Technologies",
        "description": "Browning Technologies is a rapidly growing technology company specializing in e-commerce solutions. We offer a dynamic and collaborative work environment where employees are encouraged to think creatively and innovate.",
        "contactEmail": "contact@browningtech.pk",
        "contactPhone": "042-5678901"
      }
    },
    {
      "id": "6",
      "type": "Full-Time",
      "title": "React Native Developer",
      "description": "Join our team as a Front-End Developer in Karachi, Pakistan. We are looking for a skilled and enthusiastic individual to help us create innovative web solutions. Competitive salary and great benefits package available.",
      "salary": "PKR 300K - 350K",
      "location": "Karachi",
      "company": {
        "name": "Port Solutions INC",
        "description": "Port Solutions is a leading technology company specializing in software development and digital marketing. We are committed to providing our clients with cutting-edge solutions and our employees with a supportive and rewarding work environment.",
        "contactEmail": "contact@portsolutions.pk",
        "contactPhone": "021-6543210"
      }
    },
    {
      "id": "157e",
      "type": "Remote",
      "title": "AJAX Developer",
      "description": "We are looking for a skilled AJAX Developer to work remotely. The ideal candidate should have experience with JavaScript, jQuery, and handling asynchronous requests efficiently.",
      "salary": "PKR 100K - 150K",
      "location": "Remote (Pakistan)",
      "company": {
        "name": "Netsol",
        "description": "Netsol is a leading technology company providing innovative web solutions. Our focus is on delivering high-quality applications tailored to client needs.",
        "contactEmail": "contact@netsol.pk",
        "contactPhone": "042-1234567"
      }
    }
  ]
}